//
//  practice.swift
//  Lec1
//
//  Created by HACKERU on 23/02/2020.
//  Copyright © 2020 HACKERU. All rights reserved.
//

import Foundation




/**
 
 נתון מערך:
 int[] arr = [2, 3, 4 ,5 ,6 ,7, 10]

 מצאו את סכום האיברים במערך
 מצאו את מכפלת האיברים במערך
 מצאו את המספר הגדול ביותר במערך.
 מצאו את המספר הקטן ביותר במערך.







 מלאו מערך באיברים:
 2, 4, 6, 8, 10

 א) מלאו מערך של מספרים ב5 איברים רנדומליים
 ב) **מלאו את המערך ב-5 איברים רנדומליים - יש למנוע כפילויות




 כתבו פונקציה שמקבלת מערך כפרמטר ומחזירה את סכום האיברים במערך.

 כתבו פונקציה שמקבלת מערך ומחזירה את האיבר הקטן ביותר במערך.

 כתבו פונקציה שמקבלת מערך כפרמטר ומחזירה את האיבר הגדול במערך.

 כתבו פונקציה שמקבלת מספר ומחזירה מערך מאותו גודל מלא במספרים רנדומליים.




 כתבו פעולת הדפסה עבור ה-enum
 של Rank



 כתבו פעולת הדפסה עבור ה-enum
 של Suit



























 
 */
